src zup/cf/Enums/СтатусыЗаявокСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокСотрудников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозвано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src zup/cf/Documents/ПриказНаОтпуск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПриказНаОтпуск</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОтпуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассмотрел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРассмотрения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтпуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтпусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src zup/cf/CommonModules/ОбщийСерверВызов/Ext/Module.bsl
Процедура ЗагрузкаПриказовНаОтпуск() Экспорт
	
	Если Константы.ИспользоватьRMQ.Получить() Тогда
		ДанныеПодключения =  РаботаСRMQ.ПолучитьДанныеПодключения(Справочники.ВидыПодключений.ВыгрузкаОтпуска);
	
		Попытка
			РаботаСRMQ.ПодключитьИПрочитатьСообщение(ДанныеПодключения);
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура СоздатьПриказНаОтпуск(ЗапросПараметры) Экспорт
	
	Док = Документы.ПриказНаОтпуск.НайтиПоНомеру(СокрЛП(ЗапросПараметры.Номер), ЗапросПараметры.Дата);
	Сотрудник  = Справочники.Сотрудники.НайтиПоКоду(СокрЛП(ЗапросПараметры.СотрудникКод));  
	ВидОтпуска  = Справочники.ВидыОтпусков.НайтиПоНаименованию(СокрЛП(ЗапросПараметры.ВидОтпускаКод));
	
	Если Док.Ссылка = Документы.ПриказНаОтпуск.ПустаяСсылка() Тогда
		
		ДокОбъект = Документы.ПриказНаОтпуск.СоздатьДокумент();
		
	Иначе
		
		ДокОбъект = Док.ПолучитьОбъект();
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокОбъект,ЗапросПараметры);    
	
	ДокОбъект.Сотрудник  = Сотрудник;
	ДокОбъект.ВидОтпуска  = ВидОтпуска;    
	ДокОбъект.ПометкаУдаления = Ложь;
	
	ДокОбъект.Комментарий = "Загружено из ЛК";
	ДокОбъект.Статус = перечисления.СтатусыЗаявокСотрудников.Согласовано;
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры

Процедура СоздатьПриказНаОтпускИзJSON(Структура) Экспорт
	
	чтениеJSON = Новый ЧтениеJSON;
	чтениеJSON.УстановитьСтроку(Структура);
	ЗапросПараметры = ПрочитатьJSON(чтениеJSON,,,ФорматДатыJSON.ISO);
	чтениеJSON.Закрыть();  
	
	ЗапросПараметры.Дата = ПрочитатьДатуJSON(ЗапросПараметры.Дата, ФорматДатыJSON.ISO);
	ЗапросПараметры.ДатаНачала = ПрочитатьДатуJSON(ЗапросПараметры.ДатаНачала, ФорматДатыJSON.ISO);
	ЗапросПараметры.ДатаОкончания = ПрочитатьДатуJSON(ЗапросПараметры.ДатаОкончания, ФорматДатыJSON.ISO);

	СоздатьПриказНаОтпуск(ЗапросПараметры);
	
	
КонецПроцедуры
